#include<stdio.h>
#include <stdlib.h>  
#include<time.h>                                            // 랜덤함수 헤더파일
#define Exp_boxrand (((float)(rand() % 7)  / 10) + 1.8)          // 2레벨 이후 부터 1레벨 당 경험치 수치는 1.8배 ~ 2.5배 랜덤으로 선택된다.
#define Exp_rand rand() % 7001 - 3500                           // 경험치 -3500 ~ +3500 랜덤으로 선택된다.
#define Boss_rand (((float)(rand() % 40) / 10) + 1)              // Boss 경험치는 1.0배 ~ 5.0 랜덤으로 선택된다.

void first ();
void happy_end ();
long get_long(void);
long get_replay(void);

int main()
{
    first ();

    // 변수 설정
    char name[20];
    float event_Exp = 0;                        // 각 던전마다 발생한 경험치
    float Exp = 0;                              // 경험치 창
    float Exp_box = 30000;                      // 레벨업에 필요한 경험치량 (1레벨일떄 3만 고정)
    float Prev_Exp_box = 30000;                 // 이전레벨 경험치량 보관 변수
    int level = 1;
    int turn = 1;                               // 턴 수 체크
    int user;                                   // 게임진행 방법 정하는 변수
    int stage = 0;                              // 1~5단계 스테이지
    int event = 0;                              // 단계 내 이벤트
    int monster_number = 0;                     // 몬스터를 랜덤으로 뽑기 위한 대입 연산자
    int monster_WN = 0;                         // 몬스터 약점을 랜덤으로 뽑기 위한 대입 연산자

    srand(time(NULL));                          // 랜덤 변수 시간을 이용해 계속 초기화

    printf("▶   이 름 을    입 력 해 주 세 요.\n");
    printf("▶   ");
    scanf(" %s", name);
    printf("\n\n\n");
    printf("╒═══════════════════════════════════════════════════════════════════╕\n");
    printf("╎                                                                   ╎\n");;
    printf("║                 여기는   흔들흔들   개발원입니다.                 ║\n");
    printf("║                                                                   ║\n");
    printf("   \"%s\"님   안녕하세요!   당신은   개발원에   강금당했습니다.  \n",name);
    printf("┊              탈출하려면   [ 𝗟𝘃. 𝟵 𝟵 ] 를   달성하세요.            ┊\n"); // 99
    printf("\n");
    printf("║                  Tip : 아메리카노 수혈하세요!☕                   ║\n");
    printf("║                 잠시 동안 행복해질 수도 있습니다.                 ║\n");
    printf("╎                                                                   ╎\n");
    printf("╘═══════════════════════════════════════════════════════════════════╛\n\n");
    printf("\n\n\n");

    
    while(1)                                    // 나중에 ture로 무한반복해서 99렙이나 1렙 이하일때 브레이크로 나오자
    {
        if(level == 1)
        {
            Exp_box = 30000;                    // 레벨이 1이 되면 경험치필요량 3만 고정
        }

        for(stage = 1; stage <= 5; stage++)              // 스테이지 1단계부터 5단계까지
        {
            for(event = 0; event < 5; event++)                // 단계 내 이벤트 
            {          
                event_Exp = Exp_rand;                         // -3500 ~ +3500까지 랜덤하게 뽑아준다
                Exp += event_Exp;                             // 발생한 경험치 누적

                char monster_information[70];
                monster_number = (rand() % 4) +1;
                if(monster_number == 1)
                {
                    char monster_information[70] = "Captain Ddong";
                }
                else if(monster_number == 2)
                {
                    char monster_information[70] = "Scarlet Onsi";
                }
                else if(monster_number == 3)
                {
                    char monster_information[70] = "Iron Boy";
                }
                else
                {
                    char monster_information[70] = "Juno Panther";
                }
                printf("\n\n╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴\n\n");
                printf("       ♜   제 %d 던전    \" %s \"가 나타났습니다.\n", event+1, monster_information);

                char monster_weak[20];
                monster_WN = (rand() % 4) +1;
                if(monster_WN == 1)
                {
                    char monster_weak[20] = "오른손";
                }
                else if(monster_WN == 2)
                {
                    char monster_weak[20] = "왼손";
                }
                else if(monster_WN == 3)
                {
                    char monster_weak[20] = "오른발";
                }
                else
                {
                    char monster_weak[20] = "왼발";
                }
                printf("             \t\t(Tip: %s이 약점입니다.)\n\n", monster_weak);

                    if (event_Exp >= 0)
                    {
                        printf("\t\t\t\" %s \" 를 처치하였습니다.\n", monster_information);
                        printf("         \t\t💖   %.2f 의 경험치를 획득했습니다.\n\n", event_Exp);
                    }
                    else
                    {
                        printf("\t\t\t\" %s \"를 처치하지 못했습니다.\n", monster_information);
                        printf("         \t\t💔   %.2f 의 경험치가 차감되었습니다.\n\n", event_Exp);
                    }
                if(event == 4) // 단계 내 이벤트 (6번째-보스)
                {
                    printf("\n╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴\n\n\n");
                    printf("    🧚  \" MinGun TinKerBell \"에게 이상한 사탕을 받았습니다. \n\n");
                    printf("    🍭      경험치에 영향을 미치는 것 같습니다....\n\n\n");
                    Exp = Exp * Boss_rand;                  // 기존 exp에 보스 추가경험치곱 1.0~5.0랜덤한 값 곱
                }
            }

            while(Exp > Exp_box)                             // 레벨업!
            {
                level++;

                Exp = Exp - Exp_box;                    // 초과 경험치 이월
                Exp_box = Exp_box * Exp_boxrand;
               
                printf("\n✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ✧\n\n");
                printf("      ▲       𝗟 𝗲 𝘃 𝗲 𝗹  𝗨  𝗣  !  축하합니다! \n"); // level up
                printf("      ▲       현재 레벨    [ Lv .  %3d  ]\n", level);
                if (level < 99)
                    printf("              Lv. %3d 의 경험치는 MAX 값 : %.2f.\n", level ,Exp_box);
                else
                    continue;

                if(level >= 99)                                  // 99렙이상이면 종료
                {
                    break;
                }
                printf("\n✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ✧\n\n");
            }

            while(Exp < 0)                         // 경험치가 요구량보다 작거나 음수이면
            {
                printf("\n\n✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ✧\n\n");
                printf("      ▼      𝗟 𝗲 𝘃 𝗲 𝗹  𝗗 𝗼 𝘄 𝗻  !  이런...조심하십시오....\n"); // level down
                level--;
                Exp = Exp_box - Exp;                                
                Exp_box = Exp_box / Exp_boxrand;                    // 경험치 요구량 감소
                printf("      ▼      현재 레벨    [ Lv .  %3d  ]\n", level);
                printf("\n✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ⋆ ⋄ ✧ ⋄ ⋆ ⋅ ✧\n\n");
            }
            turn++;                                          // 턴 수 증가
            printf("\n");
            printf("╔═══════════════════════════════════════════════════════════════════╗\n");
            printf("╎      현재 경험치  :  %-43.2f  ╎\n",Exp);
            printf("├╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌┥\n");
            printf("╎      현재 레  벨  :       Lv .       %3d                          ╎\n", level);
            printf("╟╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╦─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌╢\n");
            printf("║      진행  STAGE  :     %3d    ║     진행 된 턴 수 :   %4d 턴    ║\n", stage, turn);
            printf("╟╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╩─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌─╌╢\n");
            printf("╎      ▶️  다음 STAGE로 이동 시  :  숫자  [ 𝟙  ] 입력해주세요.       ╎\n");
            printf("│      ▶️  현재 STAGE에 머물 시  :  숫자  [ 𝟚  ] 입력해주세요.       │\n");
            printf("╎      ▶️  이전 STAGE로 이동 시  :  [ 𝟛  ] 이상을 입력해주세요.      ╎\n");
            printf("╚═══════════════════════════════════════════════════════════════════╝\n\n");
            printf("▶️  ");

            user = get_long();
            if (user == 1)
            {
                printf("▶️  다음 STAGE로 이동합니다.\n\n\n");
                if(level == 99)                                  // 99렙이상이면 종료
                {
                    break;
                }
                else if(level < 1)                  // 1렙이면서 경험치가 음수면 패배
                {
                    break;
                }
                continue;
                        
            }
            else if(user == 2)
            {
                printf("▶️  현재 STAGE를 다시 도전합니다.\n\n\n");
                --stage;
                if(level == 99)                                  // 99렙이상이면 종료
                {
                    break;
                }
                else if(level < 1)                  // 1렙이면서 경험치가 음수면 패배
                {
                    break;
                }
                    continue;
            }
            else
            {
                printf("▶️  이전 STAGE로 이동합니다.\n\n\n");
                --stage;
                --stage;
                if(stage <=-1)              // stage가 음수로 되는 것을 막기 위한 장치
                {
                    stage = 0;
                }
                if(level == 99)                                  // 99렙이상이면 종료
                {
                    break;
                }
                else if(level < 1)                  // 경험치가 음수면 패배
                {
                    break;
                }
                continue;
            }
            printf("\n");
        }
        printf("\n");

        if(level >= 99)                                  // 99렙이상이면 종료
        {
            printf("전설의 출현! 개발원에서 탈출하셨습니다.!\n");
            happy_end ();
            
        }
        else if(level < 1)                  
        {
            printf("╔╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╗\n");
            printf("┃                       𝕐  𝕆  𝕌       𝔻  𝕀  𝔼                       ┃\n"); 
            printf("┃         당신의 실력으론 아직 부족합니다 6개월 더 공부하세요       ┃\n");
            printf("╚╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╝\n\n\n\n");
        
        }
        if(level >= 99 || level < 1)
        {
            int Replay;
            printf("╔╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╗\n");
            printf("┃      ▶️     다시 시작하는 경우  :  숫자 [7] 입력                   ┃\n");
            printf("┃      ▶️     종료를 원하는 경우  :  [7]을 제외한 숫자 입력          ┃\n");
            printf("╚╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╴╝\n");
            printf("\n▶️  ");
            Replay = get_replay();                
            if (Replay == 7)
            {   
                level = 1;
                turn = 0;
                Exp = 0;
                continue;
            }
            else
            {
                break;
            }

        }
    }
    printf("게임을 종료합니다!\n");
    return 0;
}

long get_long(void)                                                                                 // 주노
{
    long input;
    char ch;

    while(scanf("%ld", &input) != 1)
    {
        while ((ch = getchar()) != '\n')
            putchar(ch);
        printf(":  잘못 입력하셨습니다.\n");
        printf(":  정수를 입력하여 주십시오.\n");
    }
    return input;
}

long get_replay(void)                                                                               // 주노
{
    long i;
    char k;

    while((scanf("%ld", &i) != 1))
    {
        while ((k = getchar()) != '\n')
            putchar(k);
        printf(": 잘못 입력하셨습니다.\n");
        printf(": 정수를 입력하여 주십시오.\n");
    }
    return i;
}


void first ()
{
    printf("\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⢮⠂     ⠐⠂⢮⠲⡕⢖⠕⢆⠓⡆⢇⢖⢕⢆⢇⢖⢕⢆⢇⢖⢕⢲⢸⢰⢲⢸⢐⠢⡢⡂⡂⡂⡂⡂⡂⠐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣺⡻⣆⠀⠀⠀⣜⢗⠅     ⠘⠀⡓⠙⡎⢃⠃⠓⠈⡊⢪⢊⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢪⠪⡂⡊⡂⡂⡂⡂⡂⠡⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢱⣗⢯⢯⢗⣗⢯⡳⣝⠆     ⠈⠀⠉⠈⡈⢈⠀⢉⢈⡊⡱⡑⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⢕⢕⢌⢌⢂⢂⢂⢂⠂⡂⠀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⢀⣄⡀⠀⠀⣠⡯⡯⡯⣯⡺⡵⣫⢞⠄     ⠀⠀⠀⠀⠀⢀⠀⡨⣀⢇⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⠢⡑⢔⢐⢐⢐⢐⢀⠂⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠠⣞⡾⣽⣻⢽⣫⢾⢽⢽⣪⢯⣫⢞⣝⠆     ⠀⠀⠀⠀⠀⠀⠀⠤⢠⠣⢜⠆⢇⠥⡣⡣⡣⡣⡣⡣⡣⡣⡣⡣⡣⡣⡣⡱⠨⡂⡂⡂⡂⡂⡐⢀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠙⢽⢞⡾⣽⣺⢽⢽⢽⢮⠗⠗⠉⠈⠀⠀⠀⠀      ⠀⠀⠀⠀⠠⠀⠆⠀⠀⠜⠀⡇⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢪⢊⠪⡂⡊⡂⡂⡂⡂⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡿⣽⣳⢽⢽⢽⢽⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀       ⠀⠀⠀⠂⠐⠀⠒⠐⢜⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⠰⡑⠕⢌⢂⢂⢂⢂⢂⠈⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⣤⢦⢶⣺⢽⣳⢽⢽⢽⣝⡇⠀⠀⠀⠀⠀⠀⠀        ⠀⠀⠀⠀⠀⠀⠀⠀⠂⢘⡀⡹⡘⣜⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢘⢌⠪⡂⡂⡂⡂⡂⡐⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⣤⢦⢶⣺⢽⣳⢽⢽⢽⣝⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀       ⠀⠀⠀⠂⢘⡀⡹⡘⣜⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢘⢌⠪⡂⡂⡂⡂⡂⡐⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⣤⢦⢶⣺⢽⣳⢽⢽⢽⣝⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀      ⠀⠀⠂⢘⡀⡹⡘⣜⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢘⢌⠪⡂⡂⡂⡂⡂⡐⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⣤⢦⢶⣺⢽⣳⢽⢽⢽⣝⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀     ⠀⠀⠀⠀⠀⠂⢘⡀⡹⡘⣜⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢘⢌⠪⡂⡂⡂⡂⡂⡐⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⣿⢽⢽⣺⡽⡾⣝⡯⣗⢷⡅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀        ⠀⠀⠀⠀⡉⢈⢎⢪⡊⡎⡎⡎⡎⡎⡎⡎⡎⡎⡎⡎⡎⡪⡢⡑⢌⢂⢂⢂⢂⠂⡂⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠈⠉⠉⠳⡯⡯⣗⡯⡯⣗⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀        ⠀⠀⠀⠀⡀⠨⡀⡱⡁⡇⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⢌⠪⡂⡂⡂⡂⡂⡂⠄⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⢽⣳⢯⢯⢷⣝⢷⢄⡀⠀⠀⠀⠀⠀⠀⠀⠀        ⠀⠀⠀⠀⠄⠀⠄⠠⠀⡎⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢜⢌⢊⠢⡂⡂⡂⡂⡂⡈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⢠⣺⢽⢾⢽⣺⢽⣝⣗⣗⢯⣻⡺⡵⣲⠂⠀⠀⠀      ⠀⠀⠀⠀⠰⠀⡆⠰⠄⢲⠠⡪⢢⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⠱⡡⡑⡑⡐⡐⡐⡐⡀⢂⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠫⣯⠯⠛⠺⡽⣺⡺⣮⣻⣪⢞⡽⣺⠀⠀⠀⠀⠀     ⠀⠐⠀⠪⠂⡳⢸⡑⡎⡆⡇⡇⡇⡇⡇⡇⡇⡇⡇⡇⡇⡇⢇⢪⠨⡂⡊⡂⡂⡂⡂⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣷⣻⣺⣺⡪⣯⡺⡵⡁⠀⠀⠀      ⠀⠀⠐⠀⠙⠈⡎⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢑⠕⢌⢂⢂⢂⢂⢂⠈⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣮⣗⣗⢷⠕⠛⠪⣞⢽⡀⢈⠀       ⣁⢀⡁⢈⡀⡈⢈⡊⡱⡑⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⢕⡑⢅⢕⢐⢐⢐⢐⢀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⠎⠃⠀⠀⠀⢸⣣⠃⢠⠀       ⣕⢬⢢⢸⡀⡬⣀⢇⢜⢬⢪⢪⢪⢪⢪⢪⢪⢪⢪⢪⢪⢪⢪⢪⢒⠌⢆⠢⡂⡂⡂⡂⡐⢈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⠂⠀⠀       ⠓⠘⠑⠑⠁⠚⠐⠑⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠘⠈⠊⠂⠑⠐⠐⠐⠐⠐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⣠⢀⢀⠀⠀⣀⣀⣀⣀⠀⠀⢀⢀⢠⡀⡀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⢀⡀⠀⢀⠀⣀⠀⡀⠀⠀⢀⣀⡀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣩⡟⢛⣯⠉⠀⣀⣿⣶⣶⣖⡀⠀⢨⡟⢛⣯⠍⠀⣀⣿⣶⣶⣶⡀⠀⠀⠀⠈⢉⡟⣿⣸⠃⠀⣿⣓⡟⢸⠗⠀⠀⠯⠤⣏⣸⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢴⡶⠿⠻⠶⠆⠀⣱⣲⣲⣲⠎⠀⠰⡶⠿⠻⠗⠆⠀⢱⣲⣒⣶⡆⠀⠀⠀⠠⡴⠋⢰⣇⡟⠀⠀⣒⣒⣒⡿⠀⠀⢩⡹⠋⠷⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠓⠒⠒⠂⠀⠀⠛⠒⠒⠒⠀⠀⠘⠓⠒⠒⠂⠀⠀⠛⠒⠒⠒⠀⠀⠀⠀⠀⠀⠀⠚⠘⠃⠀⠘⠓⠒⠒⠂⠀⠀⠚⠒⠒⠒⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
}


void happy_end ()
{
    printf("\n\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⣠⢢⡲⡰⡢⡠⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⢔⣝⡮⡮⣣⢣⡣⡇⣇⢇⢏⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⡇⣗⢯⢾⢝⢮⢣⠣⡣⠣⡣⡓⡜⡮⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢕⡵⡫⡮⡢⡃⡢⢑⠠⠑⡐⢅⢪⢪⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢪⢷⢽⢕⢇⢇⢎⠐⠔⡐⢈⠢⡑⡌⢎⢕⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⢸⢓⣗⢟⠳⠳⣢⠡⢑⠰⡑⡋⡊⡪⠨⡊⠢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢳⡇⡳⡕⡯⡋⡫⡸⡬⠠⠡⡋⡪⠨⠂⢅⠃⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣇⢗⢵⠑⠌⡂⣗⢕⠁⢅⠐⠄⠡⠨⢐⢈⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢪⢣⠣⡑⡼⣪⡪⡈⠄⠅⡑⢅⠌⡐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢞⠕⢕⣵⡵⡱⡡⠄⠅⡦⠂⢅⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⣫⢆⢮⡳⣄⢄⢔⠜⠠⢑⢐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡈⣷⣟⣦⢹⢘⠌⠢⠈⢌⢐⢅⢾⢷⣲⣲⢦⢤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⡐⢴⣤⢶⣝⣗⡷⣝⢷⢕⣌⡪⡨⠢⡑⠜⡮⡳⣝⢵⡫⣟⢮⢦⣤⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢾⣺⡞⡆⠈⣾⣻⣞⡷⣯⡺⡍⡇⢇⢇⢊⢪⣘⢜⡎⡯⣪⡳⡝⡮⣫⡳⣻⡾⣽⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⡤⣴⢾⣽⣽⢽⡳⠩⡂⣸⣳⡳⣕⢯⢮⡫⡯⡺⣝⢮⡫⣞⢼⡱⡝⡮⡺⣜⢵⢝⢮⣪⢳⣻⣯⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡔⠫⢛⢛⠽⣯⡷⣟⢏⠪⡐⠄⠷⣕⢯⡺⣕⢗⣝⢎⢯⢺⣪⡺⡪⣇⢗⡝⣎⢗⡕⡧⡳⡕⣎⢧⢳⢯⠇⡡⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⡨⢊⠢⡂⠕⡨⡹⡱⡱⡱⡸⡸⠐⢀⠠⠉⠊⣗⢵⡫⡳⡳⡵⣹⢝⡼⣕⡝⣎⢧⡫⡎⣗⢝⡜⡮⣪⢻⢈⠄⡅⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡌⡪⢐⠡⡂⣊⡴⣷⡳⡱⡑⢕⠬⡢⠊⢀⠐⢐⢠⡳⣳⣹⡹⡪⡯⡮⣳⡳⣕⢽⢜⢵⢕⣽⣸⢮⣺⣽⢪⡪⡐⢌⢢⠡⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⡑⢌⠢⣑⣬⣮⣿⡿⣿⡇⡣⡊⡢⢱⠸⡈⠐⠈⠄⢤⡫⣞⢖⢽⡹⡪⢯⡺⣚⡮⡷⣝⣯⡿⣺⢯⣟⣗⡿⡱⡕⡜⢌⠢⠊⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠔⡑⣜⣰⣯⣿⢿⣻⣷⣿⡿⣿⡔⡌⢌⠆⡕⡐⠠⠁⣂⢼⡺⢪⢍⠶⡕⣝⣞⡮⡏⡞⣝⢽⡮⣚⢮⣳⡻⣼⡳⡱⡕⡕⡅⢕⠡⠡⠡⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⣑⣼⣺⣟⣯⣷⣿⣿⢿⣯⣷⣿⣿⣿⣎⢆⠣⢕⢔⣐⢥⢜⡵⣃⣳⢧⢓⠜⡜⣾⢜⢮⡣⡣⣫⢿⡸⣪⢾⣝⡷⡹⡜⡎⡎⡎⡢⡑⠅⠅⠅⠄⠀⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⠀⠀⢀⣴⢾⣿⣻⣟⣯⣿⣿⣻⣽⣾⣿⣯⣿⣽⡾⣯⡿⣟⣯⢯⣗⢷⢽⢕⡯⡢⣟⣎⢧⢑⢝⢞⡮⣣⢗⣝⢼⢽⡯⣺⣳⢯⢺⢜⢮⢪⢧⢣⠕⡜⢌⠪⡈⡂⠄⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⠀⢀⣜⢽⣟⣿⣯⣿⣟⣿⣯⣿⡿⣟⣿⣽⣿⣽⣯⣿⣯⢿⣻⣞⣯⢾⢽⢽⢕⡯⣇⣻⣺⣪⣃⢪⢳⣫⢾⣝⣞⣮⣻⣽⣻⢮⢳⢕⢧⢳⠉⢗⢧⡣⡣⡑⡌⠔⡠⢁⠀⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠀⣠⡳⣕⢯⣿⣯⣷⣿⣟⣯⣿⣯⣿⣿⡿⡿⣽⣿⣷⡿⣾⢿⣽⢾⣽⡽⣽⣝⣗⢯⣞⢜⣷⣳⣳⣕⢝⢾⢽⣾⢾⡾⣯⢟⡮⡮⡳⣝⢼⡱⠀⠈⠳⣝⢜⢌⢢⢑⠔⡁⠄⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⢰⡱⣝⢾⢽⣺⣿⣽⣾⣿⣻⣿⣽⣿⡷⡻⡽⣽⣿⣿⣻⣟⣿⣽⣟⣷⣻⣗⡷⡯⡷⡽⡵⣽⣞⢷⢽⢽⣳⣗⡿⡯⢯⡫⣗⢯⡺⡝⣎⢮⡂⠀⠀⠀⠈⢧⢣⠣⡂⡃⡂⡂⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⡳⣝⢾⢝⣗⢷⢽⢯⣷⣿⢿⣯⣿⣳⡫⣝⢞⢮⣿⣿⣿⣽⢿⣞⣿⣞⣷⢯⡿⡽⣯⢯⣗⣗⢾⢽⢝⣝⢮⡺⣺⣪⡳⣝⢜⢮⢺⡪⡺⡜⡆⠀⠀⠀⠀⡰⡑⢌⢂⢂⠢⠐⠀⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⢝⣗⢽⡳⡳⣝⢵⡫⠋⠉⠉⡯⣪⢞⢮⡳⣝⢵⡿⣿⣿⣾⢿⣻⡷⣿⢽⡯⣿⢽⡯⣟⡾⣽⢽⢽⣝⢮⡳⣝⢮⣖⢽⢜⡝⣎⢧⡫⡺⣜⠂⠀⠀⠀⠀⢨⣪⣦⣧⡶⣬⣌⡄⠀⠀⠀⠀⠀\n");
    printf("⠀⠀⠀⠈⠘⠑⠽⠹⠜⠁⠀⠀⠀⠀⡯⡮⣫⢗⣝⢮⢳⣻⣿⣿⣿⣻⣟⣿⣻⣯⡿⣽⢯⢿⢽⣽⡳⡯⡷⡽⣕⢯⡺⣕⢷⢽⠵⣝⢎⢧⡫⣺⢸⠀⠀⠀⠀⠀⢸⣽⣾⢷⣻⡽⣷⡇⠀⠀⠀⠀⠀\n");
}